Revit 2024 API
ExporterIFCUtils.CanExportWallGeometryAsExtrusion Method
 Identifies if the base geometry of the wall can be represented as an extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool CanExportWallGeometryAsExtrusion(
	Element element,
	IFCRange range,
	Curve curve
)
Visual Basic
Public Shared Function CanExportWallGeometryAsExtrusion ( _
	element As Element, _
	range As IFCRange, _
	curve As Curve _
) As Boolean
Visual C++
public:
static bool CanExportWallGeometryAsExtrusion(
	Element^ element,
	IFCRange^ range,
	Curve^ curve
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The wall or in-place wall element.
range
Type: Autodesk.Revit.DB.IFC.IFCRange
 The range. This consists of two double values representing the height in Z at the start and the end of the range. If the values are identical the entire wall is used.
curve
Type: Autodesk.Revit.DB.Curve
 The wall's base curve.
Return Value
 True if the wall export can be made in the form of an extrusion, false if the geometry cannot be assigned to an extrusion.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace